#### Terraform Format and Style - dev 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.snampo_dev.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=snampo-480404/cloudresourcemanager.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=snampo-480404/artifactregistry.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["directions-backend.googleapis.com"]: Refreshing state... [id=snampo-480404/directions-backend.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=snampo-480404/storage.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["maps-android-backend.googleapis.com"]: Refreshing state... [id=snampo-480404/maps-android-backend.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=snampo-480404/sts.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=snampo-480404/secretmanager.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["apikeys.googleapis.com"]: Refreshing state... [id=snampo-480404/apikeys.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=snampo-480404/run.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["maps-ios-backend.googleapis.com"]: Refreshing state... [id=snampo-480404/maps-ios-backend.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"]: Refreshing state... [id=snampo-480404/cloudbuild.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["maps-backend.googleapis.com"]: Refreshing state... [id=snampo-480404/maps-backend.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["street-view-image-backend.googleapis.com"]: Refreshing state... [id=snampo-480404/street-view-image-backend.googleapis.com]
module.snampo_dev.module.project_services.google_project_service.project_services["places.googleapis.com"]: Refreshing state... [id=snampo-480404/places.googleapis.com]
module.snampo_dev.module.google_api_keys.google_apikeys_key.basic_key["backend-api-key"]: Refreshing state... [id=projects/snampo-480404/locations/global/keys/backend-api-key]
module.snampo_dev.module.google_api_keys.google_apikeys_key.basic_key["frontend-api-key"]: Refreshing state... [id=projects/snampo-480404/locations/global/keys/frontend-api-key]
module.snampo_dev.module.service_account.google_service_account.service_accounts["snampo-dev-cicd"]: Refreshing state... [id=projects/snampo-480404/serviceAccounts/snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.gcs_buckets.google_storage_bucket.buckets["snampo-dev-bucket"]: Refreshing state... [id=snampo-dev-bucket]
module.snampo_dev.module.service_account.google_service_account.service_accounts["snampo-dev-run"]: Refreshing state... [id=projects/snampo-480404/serviceAccounts/snampo-dev-run@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.service_account.google_service_account.service_accounts["snampo-dev-terraform"]: Refreshing state... [id=projects/snampo-480404/serviceAccounts/snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.artifact_registry["cloud-run-source-deploy"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/snampo-480404/locations/asia-northeast1/repositories/cloud-run-source-deploy]
module.snampo_dev.module.artifact_registry["snampo-dev"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/snampo-480404/locations/asia-northeast1/repositories/snampo-dev]
module.snampo_dev.module.workload_identity.google_iam_workload_identity_pool.pool["github"]: Refreshing state... [id=projects/snampo-480404/locations/global/workloadIdentityPools/github]
module.snampo_dev.module.iam_members.google_project_iam_member.sa_members["snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com:roles/editor"]: Refreshing state... [id=snampo-480404/roles/editor/serviceAccount:snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.iam_members.google_project_iam_member.group_members["gcp-organization-developers@nakamaware.com:roles/editor"]: Refreshing state... [id=snampo-480404/roles/editor/group:gcp-organization-developers@nakamaware.com]
module.snampo_dev.module.iam_members.google_project_iam_member.sa_members["snampo-dev-run@snampo-480404.iam.gserviceaccount.com:roles/logging.logWriter"]: Refreshing state... [id=snampo-480404/roles/logging.logWriter/serviceAccount:snampo-dev-run@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.iam_members.google_project_iam_member.sa_members["snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com:roles/artifactregistry.writer"]: Refreshing state... [id=snampo-480404/roles/artifactregistry.writer/serviceAccount:snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.iam_members.google_project_iam_member.sa_members["snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com:roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=snampo-480404/roles/resourcemanager.projectIamAdmin/serviceAccount:snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.iam_members.google_project_iam_member.sa_members["snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com:roles/run.developer"]: Refreshing state... [id=snampo-480404/roles/run.developer/serviceAccount:snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.iam_members.google_project_iam_member.sa_members["snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com:roles/iam.serviceAccountUser"]: Refreshing state... [id=snampo-480404/roles/iam.serviceAccountUser/serviceAccount:snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.iam_members.google_project_iam_member.sa_members["snampo-dev-run@snampo-480404.iam.gserviceaccount.com:roles/secretmanager.secretAccessor"]: Refreshing state... [id=snampo-480404/roles/secretmanager.secretAccessor/serviceAccount:snampo-dev-run@snampo-480404.iam.gserviceaccount.com]
module.snampo_dev.module.workload_identity.google_iam_workload_identity_pool_provider.gh_provider["nakamaware"]: Refreshing state... [id=projects/snampo-480404/locations/global/workloadIdentityPools/github/providers/nakamaware]
module.snampo_dev.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-dev-cicd:roles/iam.workloadIdentityUser"]: Refreshing state... [id=projects/snampo-480404/serviceAccounts/snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.snampo_dev.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-dev-terraform:roles/iam.workloadIdentityUser"]: Refreshing state... [id=projects/snampo-480404/serviceAccounts/snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.snampo_dev.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-dev-cicd:roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/snampo-480404/serviceAccounts/snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.snampo_dev.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-dev-terraform:roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/snampo-480404/serviceAccounts/snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.snampo_dev.module.secret_manager.google_secret_manager_secret.secrets["backend-api-key"]: Refreshing state... [id=projects/snampo-480404/secrets/backend-api-key]
module.snampo_dev.module.secret_manager.google_secret_manager_secret.secrets["frontend-api-key"]: Refreshing state... [id=projects/snampo-480404/secrets/frontend-api-key]
module.snampo_dev.module.secret_manager.google_secret_manager_secret_version.secret-version["backend-api-key"]: Refreshing state... [id=projects/427440607078/secrets/backend-api-key/versions/1]
module.snampo_dev.module.secret_manager.google_secret_manager_secret_version.secret-version["frontend-api-key"]: Refreshing state... [id=projects/427440607078/secrets/frontend-api-key/versions/1]
module.snampo_dev.module.cloud_run_service["snampo-dev-backend"].google_cloud_run_v2_service.default: Refreshing state... [id=projects/snampo-480404/locations/asia-northeast1/services/snampo-dev-backend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.snampo_dev.module.artifact_registry["cloud-run-source-deploy"].google_artifact_registry_repository.repo has changed
  ~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/snampo-480404/locations/asia-northeast1/repositories/cloud-run-source-deploy"
        name                   = "cloud-run-source-deploy"
      ~ update_time            = "2026-01-13T12:20:16.831970Z" -> "2026-01-17T14:29:04.975907Z"
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.snampo_dev.module.artifact_registry["snampo-dev"].google_artifact_registry_repository.repo has changed
  ~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/snampo-480404/locations/asia-northeast1/repositories/snampo-dev"
        name                   = "snampo-dev"
      ~ update_time            = "2026-01-10T10:39:46.142048Z" -> "2026-01-17T10:41:40.004801Z"
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.snampo_dev.module.google_api_keys.google_apikeys_key.basic_key["backend-api-key"] will be updated in-place
  ~ resource "google_apikeys_key" "basic_key" {
        id                    = "projects/snampo-480404/locations/global/keys/backend-api-key"
        name                  = "backend-api-key"
        # (5 unchanged attributes hidden)

      ~ restrictions {
          + api_targets {
              + service = "roads.googleapis.com"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.snampo_dev.module.project_services.google_project_service.project_services["roads.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "snampo-480404"
      + service                    = "roads.googleapis.com"
    }

  # module.snampo_dev.module.workload_identity.data.google_service_account.service_account["snampo-dev-cicd"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "service_account" {
      + account_id   = "snampo-dev-cicd"
      + disabled     = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "snampo-480404"
      + unique_id    = (known after apply)
    }

  # module.snampo_dev.module.workload_identity.data.google_service_account.service_account["snampo-dev-terraform"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "service_account" {
      + account_id   = "snampo-dev-terraform"
      + disabled     = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "snampo-480404"
      + unique_id    = (known after apply)
    }

  # module.snampo_dev.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-dev-cicd:roles/iam.serviceAccountTokenCreator"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZIRAiPCw0=" -> (known after apply)
      ~ id                 = "projects/snampo-480404/serviceAccounts/snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> (known after apply)
      ~ service_account_id = "projects/snampo-480404/serviceAccounts/snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.snampo_dev.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-dev-cicd:roles/iam.workloadIdentityUser"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZIRAiPCw0=" -> (known after apply)
      ~ id                 = "projects/snampo-480404/serviceAccounts/snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ service_account_id = "projects/snampo-480404/serviceAccounts/snampo-dev-cicd@snampo-480404.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.snampo_dev.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-dev-terraform:roles/iam.serviceAccountTokenCreator"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZIRAiO/6M=" -> (known after apply)
      ~ id                 = "projects/snampo-480404/serviceAccounts/snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> (known after apply)
      ~ service_account_id = "projects/snampo-480404/serviceAccounts/snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.snampo_dev.module.workload_identity.google_service_account_iam_binding.sa_gh_binding["snampo-dev-terraform:roles/iam.workloadIdentityUser"] must be replaced
-/+ resource "google_service_account_iam_binding" "sa_gh_binding" {
      ~ etag               = "BwZIRAiO/6M=" -> (known after apply)
      ~ id                 = "projects/snampo-480404/serviceAccounts/snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ service_account_id = "projects/snampo-480404/serviceAccounts/snampo-dev-terraform@snampo-480404.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kawayama, Action: `pull_request`, Working Directory: `terraform/env/dev`, Workflow: `CI - Terraform`*